<a href="https://colab.research.google.com/github/matbot/pandas_practice/blob/master/pandas_aggregates.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd

In [3]:
user_visits = pd.read_csv('https://raw.githubusercontent.com/dinhanhthi/data-science-learning/master/codecademy-data-science/course-10%20Data%20Analysis%20with%20Pandas/page_visits.csv')
user_visits.head()

      id first_name  ...         month utm_source
0  10043      Louis  ...     3 - March      yahoo
1  10150      Bruce  ...     3 - March    twitter
2  10155   Nicholas  ...  2 - February     google
3  10178    William  ...     3 - March      yahoo
4  10208      Karen  ...  2 - February     google

[5 rows x 6 columns]

In [5]:
click_source = user_visits.groupby('utm_source').id.count().reset_index()
click_source

  utm_source   id
0      email  462
1   facebook  823
2     google  543
3    twitter  415
4      yahoo  757

In [6]:
click_source_by_month = user_visits.groupby(['utm_source', 'month']).id.count().reset_index()
click_source_by_month

   utm_source         month   id
0       email   1 - January   43
1       email  2 - February  147
2       email     3 - March  272
3    facebook   1 - January  404
4    facebook  2 - February  263
5    facebook     3 - March  156
6      google   1 - January  127
7      google  2 - February  196
8      google     3 - March  220
9     twitter   1 - January  164
10    twitter  2 - February  154
11    twitter     3 - March   97
12      yahoo   1 - January  262
13      yahoo  2 - February  240
14      yahoo     3 - March  255

In [9]:
click_source_by_month_pivot = click_source_by_month.pivot(
    'utm_source', 'month', 'id').reset_index()
click_source_by_month_pivot

month utm_source  1 - January  2 - February  3 - March
0          email           43           147        272
1       facebook          404           263        156
2         google          127           196        220
3        twitter          164           154         97
4          yahoo          262           240        255